Hi @RavinderReddyF5 , as i wrote above the problem is that its the IP address from the Azure Private Link service.

module one outputs this:

```
output "webapp_data_private_ip" {
  value = data.azurerm_private_endpoint_connection.privateendpointdeployed.private_service_connection[0].private_ip_address
}
```
gets the value to f5 module:

`privateip = module.privateendpoint.webapp_data_private_ip`

and then creates the node:

```
resource "bigip_ltm_node" "node" {
  name             = local.nodename
  address          = var.privateip
  description      = "Azure privatelink node"
  monitor = ""
  depends_on = [bigip_ltm_pool.pool]
```

Terraform outputs: during plan:

```
2020-09-09T13:28:20.4572397Z [1m  # module.bigip.bigip_ltm_node.node[0m must be [1m[31mreplaced[0m[0m
2020-09-09T13:28:20.4572748Z [0m[31m-[0m/[32m+[0m[0m resource "bigip_ltm_node" "node" {
2020-09-09T13:28:20.4573173Z       [33m~[0m [0m[1m[0maddress[0m[0m          = "10.40.0.4" [33m->[0m [0m(known after apply) [31m# *forces replacement[0m[0m
2020-09-09T13:28:20.4573653Z       [33m~[0m [0m[1m[0mconnection_limit[0m[0m = 0 [33m->[0m [0m(known after apply)
2020-09-09T13:28:20.4574013Z         [1m[0mdescription[0m[0m      = "Azure privatelink node"
2020-09-09T13:28:20.4574386Z       [33m~[0m [0m[1m[0mdynamic_ratio[0m[0m    = 1 [33m->[0m [0m(known after apply)
2020-09-09T13:28:20.4575006Z       [33m~[0m [0m[1m[0mid[0m[0m               = "/Web-Applications/web-nzoth.azurewebsites.net_node" [33m->[0m [0m(known after apply)
2020-09-09T13:28:20.4575512Z         [1m[0mname[0m[0m             = "/Web-Applications/web-nzoth.azurewebsites.net_node"
2020-09-09T13:28:20.4576180Z       [33m~[0m [0m[1m[0mrate_limit[0m[0m       = "disabled" [33m->[0m [0m(known after apply)
2020-09-09T13:28:20.4577113Z       [33m~[0m [0m[1m[0mratio[0m[0m            = 1 [33m->[0m [0m(known after apply)
2020-09-09T13:28:20.4578012Z     }
```

10.40.0.4 is the IP set from first apply, and is still the IP. but it still forces the apply and fails with

```
[1m[31mError: [0m[0m[1mHTTP 400 :: {"code":400,"message":"01070110:3: Node address '/Web-Applications/web-nzoth.azurewebsites.net_node' is referenced by a member of pool '/Web-Applications/web-nzoth.azurewebsites.net'.","errorStack":[],"apiError":3}[0m
```

If I need some logic to remove this node from pool first before rerunning, how would that work on first run? and how do one do that?